# <center><u>Pandas <u> </center>

## 1.[Pandas Series](https://pandas.pydata.org/pandas-docs/stable/reference/series.html)

resource - https://www.youtube.com/watch?v=m7gxnZx2vT4

<p style='text-align: right;'> 1*4=4 points</p>

Import pandas and numpy with their aliases

In [2]:
import pandas as pd
import numpy as np

Create a variable a = pd.Series([ 100, 200, 300, 400])

In [3]:
a = pd.Series([100,200,300,400])

Print a, and data type

In [ ]:
print(a)
print(a.dtypes)

0    100
1    200
2    300
3    400
dtype: int64
int64

Using indexing access the element 300 from the series a.

In [ ]:
a.iloc[2]

300

What are the values of index for series a?

<p style='text-align: right;'> 2*4 = 8 points</p>

In [ ]:
a.index

RangeIndex(start=0, stop=4, step=1)

Change the index to  ['c', 'a', 'b', 'd']

In [4]:
a.index = ['c','a','b','d']
print(a)

c    100
a    200
b    300
d    400
dtype: int64

Access the value in the series with index 'd'

In [ ]:
a.loc['d']

400

Sort the values wrt to the index and print it

In [ ]:
a = a.sort_index(axis=0, ascending=True)
print(a)

0    100
1    200
2    300
3    400
dtype: int64

Create a new Pandas Series b having index as 'e', 'f', and 'g' and value 800,450,100 and print it

<p style='text-align: right;'> 4*2=8 points</p>

In [5]:
b= pd.Series([800,450,100], index = ('e','f','g'))
print(b)

e    800
f    450
g    100
dtype: int64

Append b series at the end of a series

In [6]:
#print a again after appending b into it
a = pd.concat([a,b],axis=0)
print(a)

c    100
a    200
b    300
d    400
e    800
f    450
g    100
dtype: int64

Sort the values in descending order of a and print the index of the sorted series

In [ ]:
a= a.sort_index(ascending = False)

In [ ]:
# print index of a
a.index

Index(['g', 'f', 'e', 'd', 'c', 'b', 'a'], dtype='object')

## 2. [Pandas DataFrame](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.html)

Reference:-https://www.youtube.com/watch?v=KB-19V-cSs4

<p style='text-align: right;'> 8*2 = 16 points</p>

### Part 1

<p style='text-align: right;'> 5 points</p>

Create a pandas dataframe df from the series 'a' that we used in the last section, print the dataframe

In [7]:
df = pd.DataFrame(a)
df

     0
c  100
a  200
b  300
d  400
e  800
f  450
g  100

Point to ponder! Don't you think series a and dataframe df looks alike? But there must be some difference between them. 
Hey buddy think and write your thoughts below.

In [ ]:
# happy to know your comment

# Series can only take one type of data at a time. whereas there is no such limitation when it comes to the dataframe.

<p style='text-align: right;'> 2 + 1*4 = 6 points</p>

What is the shape of the datafarme <br>

In [ ]:
df.shape

(7, 1)

Hey! remember shape (7,1) implies dataframe has 7 rows and 1 column.

What is the index of the dataframe, is it same as the series 'a' ?

In [ ]:
df.index

Index(['c', 'a', 'b', 'd', 'e', 'f', 'g'], dtype='object')

print the head and tail of the dataframe. <br>
Additional - (what does head and tali represent?)

In [ ]:
#head
df.head()

     0
c  100
a  200
b  300
d  400
e  800

In [ ]:
#tail
df.tail()

     0
b  300
d  400
e  800
f  450
g  100

Rename the columns of the dataframe as 'points'

<p style='text-align: right;'> 2 points</p>

In [8]:
df = df.rename(columns = {0: 'points'}, inplace = False)
df

   points
c     100
a     200
b     300
d     400
e     800
f     450
g     100

Create another Series 'fruits', which contains random names of fruits from ['orange','mango','apple']. The series should contain 7 elements, randomly selected from ['orange','mango','apple']

<p style='text-align: right;'> 5 points</p>

In [8]:
#Create fruits array
fruits = ['orange','orange','mango','mango','mango','apple','apple']
fruits

['orange', 'orange', 'mango', 'mango', 'mango', 'apple', 'apple']

The above output might vary based randomness

In [9]:
#Create series fruits out of fruits array
fruits = pd.Series(fruits)
fruits

0    orange
1    orange
2     mango
3     mango
4     mango
5     apple
6     apple
dtype: object

Change the index of fruits to the index of dataframe df

<p style='text-align: right;'> 5 points</p>

In [10]:
fruits = ['orange','orange','mango','mango','mango','apple','apple']
fruits = pd.Series(fruits, index = ['c','a','b','d','e','f','g'])
fruits

c    orange
a    orange
b     mango
d     mango
e     mango
f     apple
g     apple
dtype: object

Add this fruits series as a new column to the dataframe df with its column name as 'fruits' <br> print the head of the dataframe to verify

In [11]:
df1 = pd.concat([df,fruits], axis = 1)
df1 = df1.rename(columns = {0:'fruits'}, inplace= False)
df1.head()

   points  fruits
c     100  orange
a     200  orange
b     300   mango
d     400   mango
e     800   mango

<u>Bonus optional question:</u> <br>
What if we had to changed the index of the dataframe? <br>
Try to add any series to the dataframe with the origianl index (when index of series is not same as to the index of dataframe)

Use series as pd.Series([100,200,300,400,500,600,700]) and try to add it to df with column name Bonus_number.

Bonus marks: 5 points

In [ ]:
#bonus code here
number = pd.Series([100,200,300,400,500,600,700])
number

df1 = pd.concat([df1,number], axis = 1)
df1

   points  fruits      0
0     NaN     NaN  100.0
1     NaN     NaN  200.0
2     NaN     NaN  300.0
3     NaN     NaN  400.0
4     NaN     NaN  500.0
5     NaN     NaN  600.0
6     NaN     NaN  700.0
a   200.0  orange    NaN
b   300.0   mango    NaN
c   100.0  orange    NaN
d   400.0   mango    NaN
e   800.0   mango    NaN
f   450.0   apple    NaN
g   100.0   apple    NaN

### Part 2
Reference:- https://www.youtube.com/watch?v=yPVQZZmheCg

Create a dataframe  d1 where the columns are  ‘city’ : [‘Chandigarh’, ‘Delhi’, ‘Kanpur’, ‘Chennai’, ‘Manali’ ] and ‘Temperature’ : [15, 22, 20, 26,-2]

<p style='text-align: right;'> 2*5=10 points</p>

In [9]:
city = ['Chandigarh','Delhi','Kanpur','Chennai','Manali']
city = pd.Series(city)
temperature = [15,22,20,26,-2]
temperature = pd.Series(temperature)

d1 = pd.concat([city,temperature],  axis = 1)

Print d1

In [10]:
d1 = d1.rename(columns = {0:'city',1:'Temperature'}, inplace= False)
d1

         city  Temperature
0  Chandigarh           15
1       Delhi           22
2      Kanpur           20
3     Chennai           26
4      Manali           -2

What is the shape of d1.

In [21]:
d1.shape

(5, 2)

Set city = d1['city']

In [11]:
city = d1['city']

print city <br>
What is the type of city.

In [23]:
print(city)

0    Chandigarh
1         Delhi
2        Kanpur
3       Chennai
4        Manali
Name: city, dtype: object

Create another dataframe d2 where the columns are <br>
'city' - ['Bengalaru','Coimbatore','Srirangam','Pondicherry'] <br>
'Temperature' - [24,35,36,39]

<p style='text-align: right;'> 3+2+5 = 10 points</p>

In [12]:
city = ['Bengaluru','Coimbatore','Srirangam','Pondicherry']
city = pd.Series(city)
temperature = [24,35,36,39]
temperature = pd.Series(temperature)

d2 = pd.concat([city,temperature],  axis = 1)
d2 = d2.rename(columns = {0:'city',1:'Temperature'}, inplace= False)
d2

          city  Temperature
0    Bengaluru           24
1   Coimbatore           35
2    Srirangam           36
3  Pondicherry           39

print the shape of this dataframe

In [26]:
d2.shape

(4, 2)

merge the two dataframes together, save it in a new dataframe named 'd3'

In [13]:
d3 = pd.concat([d1,d2], axis = 0)
d3

          city  Temperature
0   Chandigarh           15
1        Delhi           22
2       Kanpur           20
3      Chennai           26
4       Manali           -2
0    Bengaluru           24
1   Coimbatore           35
2    Srirangam           36
3  Pondicherry           39

# fun fact at high level

1. .concat() simply stacks multiple DataFrame together either vertically, or stitches horizontally after aligning on index
2. .merge() first aligns two DataFrame' selected common column(s) or index, and then pick up the remaining columns from the aligned rows of each DataFrame

Do you know about join function? This interesting quest we give to you to find.

Select the part of the dataframe such that it contains cities where temp is less then or equal to 20 <br>
How many cities are there?

<p style='text-align: right;'> 5+5=10 points</p>

In [30]:
d3[d3['Temperature']<=20]

         city  Temperature
0  Chandigarh           15
2      Kanpur           20
4      Manali           -2

Select the part of the dataframe such that it contains the cities where tempearature greater than or equal to 35

In [31]:
d3[d3['Temperature']>=35]

          city  Temperature
1   Coimbatore           35
2    Srirangam           36
3  Pondicherry           39

## 3. Applying functions to columns and creating new columns

Reference: https://www.youtube.com/watch?v=L0wMml__Gow

<p style='text-align: right;'> 20 points</p>

We need to create another column in d3, which contains  a boolean value for each city to indicate whether it's a union territory or not. 
- HINT: Chandigarh, Pondicherry and Delhi are only 3 union territories here.

In [14]:
d3['is_ut'] = d3['city'].apply(lambda x: 'True' if x in ("Chandigarh","Delhi","Pondicherry") else 'False')

In [43]:
#print d3
d3

          city  Temperature  is_ut
0   Chandigarh           15   True
1        Delhi           22   True
2       Kanpur           20  False
3      Chennai           26  False
4       Manali           -2  False
0    Bengaluru           24  False
1   Coimbatore           35  False
2    Srirangam           36  False
3  Pondicherry           39   True

The temperatures mentioned in ‘Temperature’ column are mentioned in Celsius, we need another column which contains the same in Fahrenheit.

HINT - 
- Define a function c_to_f which takes input temp in celsius and returns a value with temperature in Fahrenheit.
- To check: c_to_f(10) should return 50.

In [16]:
# write function here
def c_to_f(x):
  y = (x*9/5) + 32
  return y

In [17]:
# check  function c_to_f(10)
c_to_f(10)

50.0

In [18]:
# apply function c_to_f to d3 to create a column 'temp_farenhiet'
d3['temp_farenhiet'] = d3['Temperature'].apply(c_to_f)
d3

          city  Temperature  is_ut  temp_farenhiet
0   Chandigarh           15   True            59.0
1        Delhi           22   True            71.6
2       Kanpur           20  False            68.0
3      Chennai           26  False            78.8
4       Manali           -2  False            28.4
0    Bengaluru           24  False            75.2
1   Coimbatore           35  False            95.0
2    Srirangam           36  False            96.8
3  Pondicherry           39   True           102.2

## 4. Indexing and selecting rows in DataFrame

Reference:-https://www.youtube.com/watch?v=XKFRFDgA7ZY

<p style='text-align: right;'> 20 points</p>

Select subset of the dataframe d1 such that it contains the cities which are union territories.

In [57]:
d3[d3['is_ut'] == "True"]

          city  Temperature is_ut  temp_farenhiet
0   Chandigarh           15  True            59.0
1        Delhi           22  True            71.6
3  Pondicherry           39  True           102.2

Select a subset of the dataframe d1 such that it contains the cities which only have temperature above 90 Farenhiet.

In [58]:
d3[d3['temp_farenhiet']>90]

          city  Temperature  is_ut  temp_farenhiet
1   Coimbatore           35  False            95.0
2    Srirangam           36  False            96.8
3  Pondicherry           39   True           102.2

Select only the first three rows of the dataframe d1.

In [59]:
d3.head(3)

         city  Temperature  is_ut  temp_farenhiet
0  Chandigarh           15   True            59.0
1       Delhi           22   True            71.6
2      Kanpur           20  False            68.0

Select all the rows and last two columns in the dataframe.

In [67]:
d3.iloc[:,-2:]

   is_ut  temp_farenhiet
0   True            59.0
1   True            71.6
2  False            68.0
3  False            78.8
4  False            28.4
0  False            75.2
1  False            95.0
2  False            96.8
3   True           102.2

## 5. Reading csv file and group by

Reference: https://www.youtube.com/watch?v=ENhGz1HkzvY <br>
https://www.youtube.com/watch?v=nulx_VmV7dE

<p style='text-align: right;'> 2*2=4 points</p>

Tutorial for how to load csv file in colab - https://www.youtube.com/watch?v=6HFlwqK3oeo

Read the file 'weather_data.csv' and store it in a pandas dataframe 'df'

In [27]:
import pandas as pd
df = pd.read_csv("/content/sample_data/Weather_Data.csv")

print the shape and head of the dataframe

In [28]:
print(df.shape)
print(df)

(7, 4)
        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017       -99999          7  Sunny
2  1/3/2017           28     -99999   Snow
3  1/4/2017       -99999          7      0
4  1/5/2017           32     -99999   Rain
5  1/6/2017           31          2  Sunny
6  1/6/2017           34          5      0

Group the dataframe wrt to 'event' and save the resulting output in a variable named 'g'

<p style='text-align: right;'> 5*3 = 15 points</p>

In [29]:
#df1['event']
g = df.groupby(by = 'event')

Print g and  type(g)

In [88]:
print(g)
type(g)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x7fccf1829690>

pandas.core.groupby.generic.DataFrameGroupBy

Iterate over all the events in g and print them

In [38]:
for i in g:
  print(i)

('0',         day  temperature  windspeed event  hot_temp
3  1/4/2017       -99999          7     0     False
6  1/6/2017           34          5     0      True)
('Rain',         day  temperature  windspeed event  hot_temp
0  1/1/2017           32          6  Rain      True
4  1/5/2017           32     -99999  Rain      True)
('Snow',         day  temperature  windspeed event  hot_temp
2  1/3/2017           28     -99999  Snow     False)
('Sunny',         day  temperature  windspeed  event  hot_temp
1  1/2/2017       -99999          7  Sunny     False
5  1/6/2017           31          2  Sunny      True)

Use the describle method on g to get the complete description on it.

In [23]:
g.describe()

      temperature                         ... windspeed
            count     mean           std  ...       50%       75%      max
event                                     ...
0             2.0 -49982.5  70734.012642  ...       6.0      6.50      7.0
Rain          2.0     32.0      0.000000  ...  -49996.5 -24995.25      6.0
Snow          1.0     28.0           NaN  ...  -99999.0 -99999.00 -99999.0
Sunny         2.0 -49984.0  70731.891322  ...       4.5      5.75      7.0

[4 rows x 16 columns]

Create a new column in the dataframe df, named 'hot_temp' which contains True if temp is above 30, else False

<p style='text-align: right;'> 5 points</p>

In [30]:
#code here to filter df with above condition
df['hot_temp'] = df['temperature'].apply(lambda x: True if x > 30 else False)

In [36]:
# print df
df[df.hot_temp == True]

        day  temperature  windspeed  event  hot_temp
0  1/1/2017           32          6   Rain      True
4  1/5/2017           32     -99999   Rain      True
5  1/6/2017           31          2  Sunny      True
6  1/6/2017           34          5      0      True

## Data Range

Reference:-https://www.youtube.com/watch?v=dRxCvSbMEto

<p style='text-align: right;'> 5*3 = 15 points</p>

Create a pandas daterange where starting date is 1st of January,2020 and end date is 1st of April 2021, store it in a new variable named 'a'

In [90]:
a = pd.date_range('1/1/2020','1/4/2021')

print a

In [91]:
print(a)

DatetimeIndex(['2020-01-01', '2020-01-02', '2020-01-03', '2020-01-04',
               '2020-01-05', '2020-01-06', '2020-01-07', '2020-01-08',
               '2020-01-09', '2020-01-10',
               ...
               '2020-12-26', '2020-12-27', '2020-12-28', '2020-12-29',
               '2020-12-30', '2020-12-31', '2021-01-01', '2021-01-02',
               '2021-01-03', '2021-01-04'],
              dtype='datetime64[ns]', length=370, freq='D')

What is the len of a?

In [92]:
len(a)

370

What is the type of a?

In [93]:
type(a)

pandas.core.indexes.datetimes.DatetimeIndex

________________
# Hey high five! You solved the 4th milestone challenge too! Pawri to banti hai ;)
________________

# FeedBack
We hope you’ve enjoyed this course so far. We’re committed to help you use "AI for All" course to its full potential, so that you have a great learning experience. And that’s why we need your help in form of a feedback here.

**Please fill this feedback form**
https://docs.google.com/forms/d/e/1FAIpQLSfjBmH0yJSSA34IhSVx4h2eDMgOAeG4Dk-yHid__NMTk3Hq5g/viewform